tmp/detect/vmware-version-detect-11055.yaml

id: vmware-version-detect
info:
  name: vmware-version-detect
  author: elouhi
  severity: info
  description: Sends a POST request containing a SOAP payload to a vCenter server to obtain version information
  reference:
    - https://www.pwndefend.com/2021/09/23/exposed-vmware-vcenter-servers-around-the-world-cve-2021-22005/
    - https://svn.nmap.org/nmap/scripts/vmware-version.nse
  tags: tech,vcenter,vmware
requests:
  - payloads:
      Subdomains: /home/mahmoud/Wordlist/AllSubdomains.txt
    attack: sniper
    threads: 100
    raw:
      - "POST /sdk/ HTTP/1.1\nHost: {{Subdomains}}\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; rv:68.0) Gecko/20100101 Firefox/68.0\nAccept-Encoding: gzip, deflate\nAccept: */*\nConnection: close\nContent-Type: application/xml\nContent-Length: 538\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n   <soap:Header>\n      <operationID>00000001-00000001</operationID>\n   </soap:Header>\n   <soap:Body>\n      <RetrieveServiceContent xmlns=\"urn:internalvim25\">\n         <_this xsi:type=\"ManagedObjectReference\" type=\"ServiceInstance\">ServiceInstance</_this>\n      </RetrieveServiceContent>\n   </soap:Body>\n</soap:Envelope>        \n"
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        part: body
        words:
          - 'ha-folder-root'
          - 'RetrieveServiceContentResponse'
      - type: word
        words:
          - "text/xml"
        part: header
    extractors:
      - type: regex
        part: body
        group: 1
        regex:
          - "<name>(.*?)</name>"
          - "<version>(.*?)</version>"
          - "<build>(.*?)</build>"
          - "<osType>(.*?)</osType>"
          - "<productLineId>(.*?)</productLineId>"
          - "<apiType>(.*?)</apiType>"
